Конвертация_данных_31_демо.Conversion_3_Plus/src/Catalogs/Объекты/Объекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ac03d05d-31ff-4be8-8134-befc15ed8a20">
  <name>Объекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Релизы</owners>
  <attributes extendedConfigurationObject="35277a40-8eae-4ba3-886e-04e15c93bfdc">
    <name>Имя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7219776e-d2bc-4a97-8797-88440b05bdfb">
    <name>Синоним</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

Конвертация_данных_31_демо.Conversion_3_Plus/src/Catalogs/Объекты/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Список имен и синонимов объектов коллекции метаданных релиза.
// Берётся из кэша дерева справочника Объекты: группа = менеджер, элементы группы = объекты.
//
// Параметры:
//  Релиз - СправочникСсылка.Релизы
//  ИмяКоллекции - Строка
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьОписаниеКоллекцииМетаданных(Релиз, ИмяКоллекции) Экспорт
	
	Результат = Новый Структура;
	Если Не ЗначениеЗаполнено(Релиз) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОписаниеПоГруппам = Расш1_ОписаниеОбъектовРелизаПоГруппам(Релиз);
	КлючГруппы = Расш1_КлючГруппыДляПодсказки(ИмяКоллекции, "");
	ОписаниеКоллекции = ОписаниеПоГруппам.Получить(КлючГруппы);
	Если ОписаниеКоллекции = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат ОписаниеКоллекции;
	
КонецФункции

// Дерево метаданных релиза из справочника Объекты: ключ группы (справочники, документы) → структура объектов.
// Один запрос на релиз: группы — менеджеры, подчинённые элементы — объекты метаданных.
//
// Параметры:
//  Релиз - СправочникСсылка.Релизы
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - имя группы в нижнем регистре без пробелов
//   * Значение - Структура - имя объекта → Структура с ключом name (синоним)
//
Функция Расш1_ОписаниеОбъектовРелизаПоГруппам(Релиз) Экспорт
	
	ОписаниеПоГруппам = Новый Соответствие;
	Если Не ЗначениеЗаполнено(Релиз) Тогда
		Возврат ОписаниеПоГруппам;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Группы.Имя КАК ИмяГруппы,
	|	Группы.Наименование КАК НаименованиеГруппы,
	|	Объекты.Имя КАК Имя,
	|	Объекты.Синоним КАК Синоним
	|ИЗ
	|	Справочник.Объекты КАК Объекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК Группы
	|		ПО Объекты.Родитель = Группы.Ссылка
	|ГДЕ
	|	Объекты.Владелец = &Релиз
	|	И Группы.Владелец = &Релиз
	|	И Группы.ЭтоГруппа
	|	И НЕ Объекты.ЭтоГруппа
	|	И НЕ Объекты.ПометкаУдаления
	|	И НЕ Группы.ПометкаУдаления";
	Запрос.УстановитьПараметр("Релиз", Релиз);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Выборка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		КлючГруппы = Расш1_КлючГруппыДляПодсказки(Выборка.ИмяГруппы, Выборка.НаименованиеГруппы);
		Если ПустаяСтрока(КлючГруппы) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеКоллекции = ОписаниеПоГруппам.Получить(КлючГруппы);
		Если ОписаниеКоллекции = Неопределено Тогда
			ОписаниеКоллекции = Новый Структура;
			ОписаниеПоГруппам.Вставить(КлючГруппы, ОписаниеКоллекции);
		КонецЕсли;
		
		Если ОписаниеКоллекции.Свойство(Выборка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		Синоним = Выборка.Синоним;
		Если ПустаяСтрока(Синоним) Тогда
			Синоним = Выборка.Имя;
		КонецЕсли;
		
		ОписаниеЭлемента = Новый Структура;
		ОписаниеЭлемента.Вставить("name", Синоним);
		ОписаниеКоллекции.Вставить(Выборка.Имя, ОписаниеЭлемента);
		
	КонецЦикла;
	
	Возврат ОписаниеПоГруппам;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Расш1_КлючГруппыДляПодсказки(ИмяГруппы, НаименованиеГруппы)
	
	Источник = СокрЛП(Строка(ИмяГруппы));
	Если ПустаяСтрока(Источник) Тогда
		Источник = СокрЛП(Строка(НаименованиеГруппы));
	КонецЕсли;
	
	Источник = СтрЗаменить(Источник, " ", "");
	Источник = СтрЗаменить(Источник, "-", "");
	
	Возврат НРег(Источник);
	
КонецФункции

#КонецОбласти
